Repository: ShogunPhyched/KNURE-TimeTable
Catalog: KNURE TimeTable iOS/Resources/*.lproj/Localizable.strings
Languages: ru

# Interface_Error
source: There Has Been an Error!
ru: Ошибка

# Interface_Ok
source: Ok
ru: Хорошо

# Interface_Cancel
source: Cancel
ru: Отмена

# Interface_Other
source: Other
ru: Другое

# TimeTable_NoItems
source: No items are selected
ru: Нет элементов для отображения

# TimeTable_NoItemsMessage
source: Use the â‰¡ button at top left to add groups, teachers or classrooms
ru: Используйте кнопку ≡ в левом верхнем углу, чтобы добавить группы, преподавателей или аудитории для отображения расписписания

# TimeTable_NoTimetable
source: No timetable
ru: Нет расписания

# TimeTable_NoTimetableMessage
source: It seems that the selected item has no timetable
ru: Похоже, что у выбранного элемента отсутствует расписание

# TimeTable_NeedToUpdate
source: Timetable needs to be updated
ru: Расписание не обновлено

# TimeTable_NeedToUpdateMessage
source: Use button at top right to update timetable
ru: Используйте кнопку в правом верхнем углу, чтобы обновить расписание

# TimeTable_Tutorial
source: Show me tutorial!
ru: Инструкция к приложению

# ModalView_Type
source: Type
ru: Тип

# ModalView_Auditory
source: Auditory
ru: Аудитория

# ModalView_Teacher
source: Teacher
ru: Преподаватель

# ModalView_Groups
source: Groups
ru: Группы

# ModalView_Hint
source: Select item to view it's timetable
ru: Выберите элемент, чтобы просмотреть его расписание

# ModalView_Details
source: Details
ru: Подробнее

# ItemList_Update
source: Update
ru: Обновить

# ItemList_Groups
source: Groups
ru: Группы

# ItemList_Teachers
source: Teachers
ru: Преподаватели

# ItemList_Auditories
source: Auditories
ru: Аудитории

# ItemList_Not_Updated
source: Not updated
ru: Не обновлено

# ItemList_Updated
source: Updated
ru: Обновлено

# ItemList_NoGroups
source: Group list is empty
ru: Список групп пуст

# ItemList_NoTeachers
source: Teacher list is empty
ru: Список преподавателей пуст

# ItemList_NoClassrooms
source: Classroom list is empty
ru: Список аудиторий пуст

# ItemList_AddGroupsHint
source: Tap + to add groups
ru: Нажмите значок + чтобы добавить группы, расписание которых необходимо отобразить

# ItemList_AddTeachersHint
source: Tap + to add teachers
ru: Нажмите значок + чтобы добавить преподавателей, расписание которых необходимо отобразить

# ItemList_AddClassroomsHint
source: Tap + to add classrooms
ru: Нажмите значок + чтобы добавить аудитории, расписание которых необходимо отобразить

# ItemList_FailedToParseList
source: Failed to process response
ru: Не удалось обработать ответ от сервера

# ItemList_FailedToUpdate
source: Failed to update timetable
ru: Не удалось обновить расписание

# ItemList_Hint1
source: Tap on item to update it's timetable
ru: Нажмите на элемент, чтобы обновить его расписание

# ItemList_Hint2
source: Swipe left on an item to remove it. All items are sorted automatically by last update. All items are available in the group list button at the top of main screen
ru: Проведите влево, чтобы удалить элемент Все элементы автоматически сортируются по дате обновления. Все выбранные элементы будут доступны на экране расписания вверху

# Settings_Promote
source: KNURE Timetable for iOS: https://appsto.re/i67M8zB
ru: Раписание ХНУРЭ для iOS: https://appsto.re/i67M8zB

# Settings_CalendarExport_NoItems
source: No Items
ru: Нет доступных элементов

# Settings_CalendarExport_NoItemsMessage
source: Here you can export the timetable of any group, teacher or auditory in you iOS Calendaer app
ru: Здесь вы можете экспортировать расписание любой группы, преподавателя или аудитории в стандартное приложение Календарь для iOS

# Settings_CalendarExport_SheetTitle
source: Export to calendar
ru: Экспорт в календарь

# Settings_CalendarExport_SheetMessage
source: Select range of dates to export
ru: Выберите промежуток дат для экспорта в календарь

# Settings_CalendarExport_Today
source: Today
ru: Сегодняшний день

# Settings_CalendarExport_Tomorrow
source: Next day
ru: Завтрашний день

# Settings_CalendarExport_ThisWeek
source: This week
ru: Эта неделя

# Settings_CalendarExport_NextWeek
source: Next week
ru: Следующая неделя

# Settings_CalendarExport_ThisMonth
source: This month
ru: Этот месяц

# Settings_CalendarExport_NextMonth
source: Next month
ru: Следующий месяц

# Settings_CalendarExport_Full
source: Full semester
ru: Весь семестр

# Settings_CalendarExport_AccessForbidden
source: Access to calendar is denied
ru: Доступ к календарю запрещён пользователем

# Settings_CalendarHint1
source: Select the item you wish to export into your Calendar App
ru: Выберите элемент, который необходимо экспортировать в Календарь

# Settings_CalendarHint2
source: A new calendar with the selected item name will be created in your Calendar App
ru: В приложении Календарь будет создан новый календарь с названием выбранного элемента
